aproape gata, mai necesita testare
